﻿/* Notification that a user reacted to a post that the current user was tagged in */
"reacted_tagged_in_1" = "%@ تفاعل مع منشور تمت الإشارة لحسابك فيه";

/* Notification that 2 users reacted to a post that the current user was tagged in */
"reacted_tagged_in_2" = "%@ و %@ تفاعلا مع منشور تمت الإشارة لحسابك فيه";

/* Notification that a user reposted a post that the current user was tagged in */
"reposted_tagged_in_1" = "%@  نشر منشورا تمت الإشارة لك فيه";

/* Notification that 2 users reposted a post that the current user was tagged in */
"reposted_tagged_in_2" = "%@ و %@ نشرا منشورا تمت الإشارة لك فيه";

/* Notification that a user zapped a post that the current user was tagged in */
"zapped_tagged_in_1" = "%@ ومّض منشورا تمت الإشارة لك فيه";

/* Notification that 2 users zapped a post that the current user was tagged in */
"zapped_tagged_in_2" = "%@ و %@ ومّضا منشورا تمت الإشارة لك فيه";

/* Notification that a user reacted to the current user's post */
"reacted_your_post_1" = "%@ تفاعل مع منشورك";

/* Notification that 2 users reacted to the current user's profile */
"reacted_your_post_2" = "%@ و %@ تفاعلا مع منشورك";

/* Notification that a user reposted the current user's post */
"reposted_your_post_1" = "%@ نشر منشورك";

/* Notification that 2 users reposted the current user's post */
"reposted_your_post_2" = "%@ و %@ نشرا منشورك";

/* Notification that a user zapped the current user's post */
"zapped_your_post_1" = "%@ ومّض منشورك";

/* Notification that 2 users zapped the current user's post */
"zapped_your_post_2" = "%@ و %@ ومّضا منشورك";

/* Notification that a user reacted to the current user's profile */
"reacted_your_profile_1" = "%@ تفاعل مع حسابك";

/* Notification that 2 users reacted to the current user's profile */
"reacted_your_profile_2" = "%@ و %@ تفاعلا مع حسابك";

/* Notification that a user reposted the current user's profile */
"reposted_your_profile_1" = "%@ نشر حسابك";

/* Notification that 2 users reposted the current user's profile */
"reposted_your_profile_2" = "%@ و %@ نشرا حسابك";

/* Notification that a user zapped the current user's profile */
"zapped_your_profile_1" = "%@ ومّض لحسابك";

/* Notification that 2 users zapped the current user's profile */
"zapped_your_profile_2" = "%@ و %@ ومّضا لحسابك";
/* No comment provided by engineer. */
"%@" = "%@";

/* Alert message that informs a user was blocked. */
"%@ has been blocked" = "تم حظر %@";

/* When a note or profile is not found when searching for it via its note id */
"%@ not found" = "لم يتم العثور على %@";

/* Explanation of what is done to keep personally identifiable information private. There is a heading that precedes this explanation which is a variable to this string. */
"%@. Creating an account doesn't require a phone number, email or name. Get started right away with zero friction." = "%@. انشاء حسابك لايتطلب رقم جوال أو بريد الكتروني أو معلومات شخصية. احصل على حسابك الخاص في ثواني.";

/* Explanation of what is done to keep private data encrypted. There is a heading that precedes this explanation which is a variable to this string. */
"%@. End-to-End encrypted private messaging. Keep Big Tech out of your DMs" = "%@. محادثات خاصة مشفرة كليا. ";

/* Explanation of what can be done by users to earn money. There is a heading that precedes this explanation which is a variable to this string. */
"%@. Tip your friend's posts and stack sats with Bitcoin⚡️, the native currency of the internet." = "%@. بسهولة مطلقة، أرسل و استقبل برقيات البتكوين ⚡️عملة الانترنت العالمية.";

/* Sentence composed of 2 variables to describe how many reactions there are on a post. In source English, the first variable is the number of reactions, and the second variable is 'Reaction' or 'Reactions'.
   Sentence composed of 2 variables to describe how many reposts. In source English, the first variable is the number of reposts, and the second variable is 'Repost' or 'Reposts'.
   Sentence composed of 2 variables to describe how many zap payments there are on a post. In source English, the first variable is the number of zap payments, and the second variable is 'Zap' or 'Zaps'. */
"%@.font(.body.bold())) %@" = "%1$@.font(.body.bold())) %2$@";

/* Sentence composed of 2 variables to describe how many people are following a user. In source English, the first variable is the number of followers, and the second variable is 'Follower' or 'Followers'.
   Sentence composed of 2 variables to describe how many profiles a user is following. In source English, the first variable is the number of profiles being followed, and the second variable is 'Following'.
   Sentence composed of 2 variables to describe how many relay servers a user is connected. In source English, the first variable is the number of relay servers, and the second variable is 'Relay' or 'Relays'. */
"%@.font(.subheadline.weight(.medium))) %@" = "%1$@.font(.subheadline.weight(.medium))) %2$@";

/* Fraction of how many of the user's relay servers that are operational. */
"%@/%@" = "%1$@/%2$@";

/* Description of how the nip05 identifier would be used for verification. */
"'%@' at '%@' will be used for verification" = "سيتم التحقق وتوثيق \"%1$@\" @ %2$@\"";

/* Description of why the nip05 identifier is invalid. */
"'%@' is an invalid NIP-05 identifier. It should look like an email." = "'%@' عنوان NIP-05 غير صالح. من المفترض أن يشابه صيغة الايميل مثل المثال الموضح.";

/* No comment provided by engineer. */
"@" = "@";

/* Label to prompt for about text entry for user to describe about themself. */
"About" = "النبذة التعريفية";

/* Label for About Me section of user profile form. */
"About Me" = "النبذة التعريفية";

/* Placeholder text for About Me description. */
"Absolute Boss" = "مدير كبير";

/* Button to accept the end user license agreement before being allowed into the app. */
"Accept" = "موافق";

/* Label to indicate the public ID of the account. */
"Account ID" = "معرف الحساب";

/* Title for confirmation dialog to either share, report, or block a profile. */
"Actions" = "خيارات";

/* Button to confirm adding user inputted relay. */
"Add" = "اضافة";

/* Button label to re-add all original participants as profiles to reply to in a note */
"Add all" = "اضافة الجميع";

/* Context menu option for adding a note bookmark. */
"Add Bookmark" = "اضافة للمنشورات المرجعية";

/* Button to add recommended relay server.
   Label for section for adding a relay server. */
"Add Relay" = "اضافة موصّل";

/* Label to display relay contact user. */
"Admin" = "المدير";

/* Label for filter for all notifications. */
"All" = "الكل";

/* Setting to always show and never blur images */
"Always show images" = "دائما اعرض الصور";

/* Picker option to indicate that a zap should be sent anonymously and not identify the user as who sent it. */
"Anonymous" = "إخفاء الهوية";

/* Any amount of sats */
"Any" = "أي شيء";

/* Prompt for optional entry of API Key to use translation server. */
"API Key (optional)" = "مفتاح API (اختياري)";

/* Prompt for required entry of API Key to use translation server. */
"API Key (required)" = "مفتاح API (مطلوب)";

/* Alert message to ask if user wants to repost a post. */
"Are you sure you want to repost this?" = "هل أنت متأكد من اعادة النشر؟";

/* Placeholder text for a comment to send as part of a zap to the user. */
"Awesome post!" = "منشور رائع!";

/* Label for Banner Image section of user profile form. */
"Banner Image" = "صورة الخلفية";

/* Reminder to user that they should save their account information. */
"Before we get started, you'll need to save your account info, otherwise you won't be able to login in the future if you ever uninstall Damus." = "قبل البدء، يجب عليك حفظ معلومات حسابك لتتمكن من الوصول إليه مستقبلا في حالة حذف دامُس أو تغيير جهازك.";

/* Dropdown option label for Lightning wallet, Bitcoin Beach. */
"Bitcoin Beach" = "Bitcoin Beach";

/* Label for Bitcoin Lightning Tips section of user profile form. */
"Bitcoin Lightning Tips" = "عنوان البرق";

/* Dropdown option label for Lightning wallet, Blixt Wallet */
"Blixt Wallet" = "Blixt Wallet";

/* Alert button to block a user.
   Button to block a profile.
   Context menu option for blocking users. */
"Block" = "حظر";

/* Alert message prompt to ask if a user should be blocked. */
"Block %@?" = "حظر %@؟";

/* Title of alert for blocking a user. */
"Block User" = "حظر المستخدم";

/* Sidebar menu label for Profile view. */
"Blocked" = "قائمة الحظر";

/* Navigation title of view to see list of blocked users. */
"Blocked Users" = "المحظورون";

/* Dropdown option label for Lightning wallet, Blue Wallet. */
"Blue Wallet" = "Blue Wallet";

/* Sidebar menu label for Bookmarks view.
   Title of bookmarks view */
"Bookmarks" = "منشورات مرجعية";

/* Accessibility label for boosts button */
"Boosts" = "تعزيز";

/* Dropdown option label for Lightning wallet, Breez. */
"Breez" = "Breez";

/* Button to broadcast note to all your relays
   Context menu option for broadcasting the user's note to all of the user's connected relay servers. */
"Broadcast" = "بث";

/* Alert button to cancel out of alert for blocking a user.
   Button to cancel a repost.
   Button to cancel out of alert that creates a new mutelist.
   Button to cancel out of posting a note.
   Button to cancel out of reposting a post.
   Button to cancel out of view adding user inputted relay.
   Cancel deleting the user.
   Cancel out of logging out the user.
   Cancel out of search view. */
"Cancel" = "الغاء";

/* Dropdown option label for Lightning wallet, Cash App. */
"Cash App" = "Cash App";

/* Button for clearing bookmarks data. */
"Clear All" = "ازالة الكل";

/* Button to clear image cache. */
"Clear Cache" = "مسح البيانات المؤقتة";

/* Header text to indicate that the text field below it is a comment that will be used to send as part of a zap to the user. */
"Comment" = "تعليق";

/* Label to display relay contact information. */
"Contact" = "تواصل";

/* Continue with deleting the user. */
"Continue" = "استمرار";

/* Label indicating that a user's key was copied. */
"Copied" = "تم النسخ";

/* Button to copy a relay server address. */
"Copy" = "نسخ";

/* Context menu option for copying the ID of the account that created the note. */
"Copy Account ID" = "نسخ عنوان الحساب";

/* Context menu option to copy an image into clipboard.
   Context menu option to copy an image to clipboard. */
"Copy Image" = "نسخ الصورة";

/* Context menu option to copy the URL of an image into clipboard. */
"Copy Image URL" = "نسخ رابط الصورة";

/* Title of section for copying a Lightning invoice identifier. */
"Copy invoice" = "نسخ البرقية";

/* Button to copy link to note */
"Copy Link" = "نسخ الرابط";

/* Context menu option for copying a user's Lightning URL. */
"Copy LNURL" = "نسخ LNURL";

/* Context menu option for copying the ID of the note. */
"Copy Note ID" = "نسخ معرف المنشور";

/* Context menu option for copying the JSON text from the note. */
"Copy Note JSON" = "نسخ المنشور بصيغة JSON";

/* Button to copy report ID. */
"Copy Report ID" = "نسخ معرف البلاغ";

/* Context menu option for copying the text from an note. */
"Copy Text" = "نسخ النص";

/* Context menu option for copying the ID of the user who created the note. */
"Copy User Pubkey" = "نسخ معرف الحساب";

/* Alert message to indicate that the blocked user could not be found. */
"Could not find user to block..." = "لم يتم العثور حساب لحظره";

/* Button to create account. */
"Create" = "انشاء";

/* Button to create an account. */
"Create Account" = "انشاء حساب";

/* Title of alert prompting the user to create a new mutelist. */
"Create new mutelist" = "أنشئ قائمة حظر جديدة";

/* Example description about Bitcoin creator(s), Satoshi Nakamoto. */
"Creator(s) of Bitcoin. Absolute legend." = "مبتكر البتكوين. اسطورة لن تتكرر.";

/* Dropdown option for selecting a custom translation server. */
"Custom" = "مخصص";

/* Header text to indicate that the text field below it is to enter a custom zap amount. */
"Custom Zap Amount" = "تخصيص قيمة الومضة";

/* Name of the app, shown on the first screen when user is not logged in. */
"Damus" = "دامُس";

/* Dropdown option for selecting DeepL as the translation service. */
"DeepL (Proprietary, Higher Accuracy)" = "DeepL (دقة أعلى، ملكية خاصة)";

/* Button to pay a Lightning invoice with the user's default Lightning wallet. */
"Default Wallet" = "المحفظة الافتراضية";

/* Section title for zap configuration */
"Default Zap Amount in sats" = "قيمة الوميض الافتراضية";

/* Button for deleting the users account.
   Button to delete a relay server that the user connects to.
   Button to remove a user from their blocklist. */
"Delete" = "حذف";

/* Button to delete the user's account. */
"Delete Account" = "حذف الحساب";

/* Alert message to indicate this is a deleted account */
"Deleted Account" = "حذف الحساب";

/* Label to display relay description. */
"Description" = "الوصف";

/* Button to disable image animation */
"Disable animations" = "تعطيل المؤثرات المتحركة";

/* Button to dismiss a text field alert. */
"Dismiss" = "اغلاق";

/* Label to prompt display name entry. */
"Display Name" = "الاسم";

/* Navigation title for DMs view, where DM is the English abbreviation for Direct Message.
   Navigation title for view of DMs, where DM is an English abbreviation for Direct Message.
   Picker option for DM selector for seeing only DMs that have been responded to. DM is the English abbreviation for Direct Message.
   Toolbar label for DMs view, where DM is the English abbreviation for Direct Message. */
"DMs" = "الرسائل الخاصة";

/* Button to dismiss wallet selection view for paying Lightning invoice. */
"Done" = "انهاء";

/* Heading indicating that this application allows users to earn money. */
"Earn Money" = "اكسب المال.";

/* Button to edit user's profile. */
"Edit" = "تحرير";

/* Text indicating that the view is used for editing which participants are replied to in a note. */
"Edit participants" = "تحرير المشاركين";

/* Heading indicating that this application keeps private messaging end-to-end encrypted. */
"Encrypted" = "مشفر";

/* Prompt for user to enter an account key to login. */
"Enter your account key to login:" = "أدخل مفتاح حسابك لتسجيل الدخول:";

/* Message to display when there was an error fetching a lightning invoice while attempting to zap. */
"Error fetching lightning invoice" = "خطأ في جلب البرقية";

/* Error message indicating why saving keys failed. */
"Error: %@" = "خطأ: %@";

/* Label indicating that the below text is the EULA, an acronym for End User License Agreement. */
"EULA" = "اتفاقية الاستخدام";

/* Description of public zap type where the zap is sent publicly and identifies the user who sent it. */
"Everyone on can see that you zapped" = "سيظهر للجميع أنك من أرسل الومضة";

/* Button label text for filtering relay servers. */
"Filter" = "تصفية";

/* Button to follow a user. */
"Follow" = "متابعة";

/* Button to follow a user back. */
"Follow Back" = "رد المتابعة";

/* Text on QR code view to prompt viewer looking at screen to follow the user. */
"Follow me on nostr" = "تابعني على نوستر";

/* Label describing followers of a user.
   Navigation bar title for view that shows who is following a user. */
"Followers" = "المتابِعون";

/* Navigation bar title for view that shows who a user is following. */
"Following" = "المتابَعون";

/* Label to indicate that the user is in the process of following another user. */
"Following..." = "يتابع...";

/* Text to indicate that a user is following your profile. */
"Follows you" = "متابع لك";

/* Dropdown option for selecting Free plan for DeepL translation service. */
"Free" = "مجاني";

/* Button to navigate to DeepL website to get a translation API key. */
"Get API Key" = "احصل على مفتاح API";

/* No comment provided by engineer. */
"Hello, World!" = "مرحبا، يا عالم!";

/* Button to hide a post from a user who has been blocked. */
"Hide" = "اخفاء";

/* Button to hide the DeepL translation API key.
   Button to hide the LibreTranslate server API key. */
"Hide API Key" = "اخفاء مفتاح API";

/* Navigation bar title for Home view where posts and replies appear from those who the user is following. */
"Home" = "الرئيسية";

/* Placeholder example text for profile picture URL. */
"https://example.com/pic.jpg" = "https://example.com/pic.jpg";

/* Placeholder example text for website URL for user profile. */
"https://jb55.com" = "https://jb55.com";

/* Button for user to report that the account or content has illegal content. */
"Illegal content" = "محتوى غير قانوني";

/* Section title for images configuration. */
"Images" = "الصور";

/* Error message indicating that an invalid account key was entered for login. */
"Invalid key" = "المفتاح غير صالح";

/* Message to display when there was an error attempting to zap due to an invalid lightning address. */
"Invalid lightning address" = "عنوان برق غير صالح";

/* Title of alerting as invalid tip address. */
"Invalid Tip Address" = "عنوان غير صالح";

/* Button for user to report that the account or content has spam. */
"It's spam" = "سبام";

/* Placeholder example text for identifier used for NIP-05 verification. */
"jb55@jb55.com" = "jb55@jb55.com";

/* Moves the post button to the left side of the screen */
"Left Handed" = "تفضيل استخدام اليد اليسرى";

/* Button to complete account creation and start using the app. */
"Let's go!" = "هيا بنا!";

/* Dropdown option for selecting LibreTranslate as the translation service. */
"LibreTranslate (Open Source)" = "LibreTranslate (مفتوح المصدر)";

/* Placeholder text for entry of Lightning Address or LNURL. */
"Lightning Address or LNURL" = "عنوان البرق أو LNURL";

/* Indicates that the view is for paying a Lightning invoice. */
"Lightning Invoice" = "برقية";

/* Accessibility Label for Like button */
"Like" = "اعجاب";

/* Dropdown option label for Lightning wallet, LNLink. */
"LNLink" = "LNLink";

/* Button text for loading more events, where the variable is the number of events. */
"Load %@ more" = "تحميل %@ اضافي";

/* Face ID usage description shown when trying to access private key */
"Local authentication to access private key" = "التحقق للوصول للمفتاح الخاص";

/* Dropdown option label for system default for Lightning wallet. */
"Local default" = "الاختيار";

/* Button to log into account.
   Button to log into an account.
   Title of view to log into an account. */
"Login" = "الدخول";

/* Alert for logging out the user.
   Button for logging out the user.
   Button to close the alert that informs that the current account has been deleted. */
"Logout" = "الخروج";

/* Label that appears when searching for note or profile */
"Looking for %@..." = "البحث عن %@...";

/* Reminder message in alert to get customer to verify that their private security account key is saved saved before logging out. */
"Make sure your nsec account key is saved before you logout or you will lose access to this account" = "تأكد من حفظ مفتاح حسابك السري قبل الخروج حتى لا تفقد امكانية الدخول الى حسابك.";

/* Label for filter for seeing mention notifications (replies, etc). */
"Mentions" = "الإشارات";

/* Section header for miscellaneous user configuration */
"Miscellaneous" = "تفضيلات أخرى";

/* Dropdown option label for Lightning wallet, Muun. */
"Muun" = "Muun";

/* Label for NIP-05 Verification section of user profile form. */
"NIP-05 Verification" = "توثيق NIP-05";

/* Button to cancel out of posting a note after being alerted that it looks like they might be posting a private key. */
"No" = "لا";

/* Alert message prompt that asks if the user wants to create a new block list, overwriting previous block lists. */
"No block list found, create a new one? This will overwrite any previous block lists." = "لم نعثر على قائمة حظر. هل تريد انشاء قائمة جديدة؟ سيتم استبدال أي قوائم سابقة ان وجدت";

/* No comment provided by engineer. */
"No data available" = "بيانات غير متوفرة";

/* Description of anonymous zap type where the zap is sent anonymously and does not identify the user who sent it. */
"No one can see that you zapped" = "لن يعرف أحد مرسل الومضة";

/* Description of non-zap type where sats are sent to the user's wallet as a regular Lightning payment, not as a zap. */
"No zaps are sent, only a lightning payment." = "لن يتم ارسال ومضة. سيتم ارسال عملية برق.";

/* No search results. */
"none" = "لا شيء";

/* Dropdown option for selecting no translation service. */
"none_translation_service" = "بِلا";

/* Picker option to indicate that sats should be sent to the user's wallet as a regular Lightning payment, not as a zap. */
"none_zap_type" = "ليست ومضة";

/* Dropdown option label for system default for NostrBuild image uploader. */
"NostrBuild" = "NostrBuild";

/* Dropdown option label for system default for NostrImg image uploader. */
"NostrImg" = "NostrImg";

/* Alert user that they might be attempting to paste a private key and ask them to confirm. */
"Note contains \"nsec1\" private key. Are you sure?" = "يحتوي المنشور على مفتاح خاص \"nsec1\". هل أنت متأكد؟";

/* Indicates that there are no notes in the timeline to view. */
"Nothing to see here. Check back later!" = "لا جديد في هذه اللحظة. يرجى المعاودة لاحقا!";

/* Toolbar label for Notifications view. */
"Notifications" = "التنبيهات";

/* String indicating that a given timestamp just occurred */
"now" = "الان";

/* Prompt for user to enter in an account key to login. This text shows the characters the key could start with if it was a private key. */
"nsec1..." = "nsec1...";

/* Button for user to report that the account or content has nudity or explicit content. */
"Nudity or explicit content" = "عري أو محتوى فاضح";

/* Button to dismiss the alert. */
"Ok" = "حسنا";

/* Help text on green lock icon that explains that only the current user can see the message of a zap event and who sent the zap. */
"Only you can see this message and who sent it." = "هذه الرسالة تظهر لك أنت ومرسل الومضة فقط.";

/* Label indicating that a form input is optional. */
"optional" = "غير الزامي";

/* Section header that indicates the relay server requires payment. */
"Paid Relay" = "موصل مدفوع";

/* Button to pay a Lightning invoice. */
"Pay" = "ادفع";

/* Navigation bar title for view to pay Lightning invoice. */
"Pay the Lightning invoice" = "ادفع البرقية";

/* Alert for deleting the users account.
   Section title for deleting the user */
"Permanently Delete Account" = "حذف الحساب للأبد";

/* Dropdown option label for Lightning wallet, Phoenix. */
"Phoenix" = "Phoenix";

/* Prompt selection of DeepL subscription plan to perform machine translations on notes */
"Plan" = "الخطة";

/* Instructions on how to filter a specific timeline feed by choosing relay servers to filter on. */
"Please choose relays from the list below to filter the current feed:" = "رجاء، اختر الموصلات من القائمة أدناه لتصفية محتوى هذه الصفحة:";

/* Button to post a note. */
"Post" = "انشر";

/* Text to indicate that what is being shown is a post from a user who has been blocked. */
"Post from a user you've blocked" = "منشور لمستخدم محظور";

/* Label for filter for seeing only posts (instead of posts and replies).
   Label for filter for seeing only your posts (instead of posts and replies). */
"Posts" = "المنشورات";

/* Label for filter for seeing posts and replies (instead of only posts).
   Label for filter for seeing your posts and replies (instead of only your posts). */
"Posts & Replies" = "المنشورات والردود";

/* Heading indicating that this application keeps personally identifiable information private. A sentence describing what is done to keep data private comes after this heading.
   Picker option to indicate that a zap should be sent privately and not identify the user to the public. */
"Private" = "خاصة";

/* Label to indicate that the text below is the user's private key used by only the user themself as a secret to login to access their account.
   Title of the secure field that holds the user's private key. */
"Private Key" = "المفتاح السري";

/* Description of private zap type where the zap is sent privately and does not identify the user to the public. */
"private_zap_description" = "فقط '%@' سيعرف أنك من أرسل الومضة";

/* Dropdown option for selecting Pro plan for DeepL translation service. */
"Pro" = "برو";

/* Sidebar menu label for Profile view. */
"Profile" = "الملف الشخصي";

/* Label for Profile Picture section of user profile form. */
"Profile Picture" = "صورة الحساب";

/* Picker option to indicate that a zap should be sent publicly and identify the user as who sent it. */
"Public" = "علنية";

/* Section title for the user's public account ID. */
"Public Account ID" = "معرف الحساب";

/* Label indicating that the text is a user's public account key.
   Label to indicate that text below is the user's public key used by others to uniquely refer to the user. */
"Public Key" = "المفتاح العام";

/* Label indicating that the text is a user's public account key. */
"Public key" = "المفتاح العام";

/* Prompt to ask user if the key they entered is a public key. */
"Public Key?" = "مفتاح عام؟";

/* Navigation bar title for Reactions view. */
"Reactions" = "التفاعل";

/* Section title for recommend relay servers that could be added as part of configuration */
"Recommended Relays" = "موصّلات موصى بها";

/* Button to reject the end user license agreement, which disallows the user from being let into the app. */
"Reject" = "رفض";

/* Label to display relay address.
   Text field for relay server. Used for testing purposes. */
"Relay" = "موصّل";

/* Header text for relay server list for configuration.
   Sidebar menu label for Relays view. */
"Relays" = "موصّلات";

/* Description of what was done as a result of sending a report to relay servers. */
"Relays have been notified and clients will be able to use this information to filter content. Thank you!" = "تم ابلاغ الموصّلات وسيتم الاستفادة من هذا البلاغ لتصفية المحتوى. شكرا لك!";

/* Button label to remove all participants from a note reply. */
"Remove all" = "حذف المشاركين";

/* Context menu option for removing a note bookmark. */
"Remove Bookmark" = "ازالة المنشور المرجعي";

/* Accessibility label for reply button */
"Reply" = "رد";

/* Label to indicate that the user is replying to 1 user. */
"Replying to %@" = "رد على %@";

/* Label to indicate that the user is replying to 2 users. */
"Replying to %@ & %@" = "رد على %1$@ و %2$@";

/* Label to indicate that the user is replying to themself. */
"Replying to self" = "رد على منشوره";

/* Indicating that the user is replying to the following listed people. */
"Replying to:" = "رد على:";

/* Button to report a profile.
   Context menu option for reporting content.
   Label indicating that the current view is for the user to report content. */
"Report" = "ابلاغ";

/* Label indicating that the text underneath is the identifier of the report that was sent to relay servers. */
"Report ID:" = "معرف البلاغ";

/* Message indicating that a report was successfully sent to relay servers. */
"Report sent!" = "تم الابلاغ!";

/* Button to confirm reposting a post.
   Title of alert for confirming to repost a post. */
"Repost" = "إعادة نشر";

/* Text indicating that the post was reposted (i.e. re-shared). */
"Reposted" = "منشور مُعاد";

/* Navigation bar title for Reposts view. */
"Reposts" = "اعادات النشر";

/* Picker option for DM selector for seeing only message requests (DMs that someone else sent the user which has not been responded to yet). DM is the English abbreviation for Direct Message. */
"Requests" = "طلبات";

/* Button to retry completing account creation after an error occurred. */
"Retry" = "اعادة المحاولة";

/* Dropdown option label for Lightning wallet, River */
"River" = "River";

/* Example username of Bitcoin creator(s), Satoshi Nakamoto. */
"satoshi" = "ساتوشي";

/* Name of Bitcoin creator(s). */
"Satoshi Nakamoto" = "ساتوشي ناكاموتو";

/* Button for saving profile. */
"Save" = "حفظ";

/* Context menu option to save an image. */
"Save Image" = "حفظ الصورة";

/* Text on QR code view to prompt viewer to scan the QR code on screen with their device camera. */
"Scan the code" = "امسح رمز الاستجابة السريع (QR)";

/* Navigation link to search hashtag. */
"Search hashtag: #%@" = "البحث عن وسم: #%@";

/* Placeholder text to prompt entry of search query. */
"Search..." = "بحث...";

/* Section title for user's secret account login key. */
"Secret Account Login Key" = "المفتاح السري للحساب";

/* Title of section for selecting a Lightning wallet to pay a Lightning invoice. */
"Select a Lightning wallet" = "اختر محفظة البرق";

/* Prompt selection of user's default wallet */
"Select default wallet" = "المحفظة الافتراضية";

/* Prompt selection of user's image uploader */
"Select image uploader" = "خدمة رفع الصور";

/* Text prompt for user to send a message to the other user. */
"Send a message to start the conversation..." = "أرسل رسالة لبدء المحادثة...";

/* Prompt selection of LibreTranslate server to perform machine translations on notes */
"Server" = "خادم";

/* Prompt selection of translation service provider. */
"Service" = "مقدم الخدمة";

/* Navigation title for Settings view.
   Sidebar menu label for accessing the app settings */
"Settings" = "الاعدادات";

/* Button to share a post
   Button to share an image.
   Button to share the link to a profile. */
"Share" = "مشاركة";

/* Title text to indicate that the buttons below are meant to be used to share a note with others. */
"Share Note" = "مشاركة المنشور";

/* Button to present iOS share sheet */
"Share Via..." = "مشاركة عبر...";

/* Button to show a post from a user who has been blocked.
   Toggle to show or hide user's secret account login key. */
"Show" = "عرض";

/* Button to show the DeepL translation API key.
   Button to show the LibreTranslate server API key. */
"Show API Key" = "عرض مفتاح API";

/* Button to show entire note. */
"Show more" = "عرض المزيد";

/* Toggle to show or hide selection of wallet. */
"Show wallet selector" = "هل تريد اختيار المحفظة عند كل عملية دفع؟";

/* Section title for signing out */
"Sign Out" = "تسجيل الخروج";

/* Sidebar menu label to sign out of the account. */
"Sign out" = "خروج";

/* Label to display relay software. */
"Software" = "البرنامج";

/* Dropdown option label for Lightning wallet, Strike. */
"Strike" = "Strike";

/* Label to display relay's supported NIPs. */
"Supported NIPs" = "الـ NIPs المدعومة";

/* Button to close out of alert that informs that the action to block a user was successful. */
"Thanks!" = "شكرا!";

/* Giving the description of the alert message. */
"The address should either begin with LNURL or should look like an email address." = "يجب أن يبدأ العنوان بـ LNURL أو يكون مماثل لصيغة البريد الالكتروني.";

/* Button for user to report that the account is impersonating someone. */
"They are impersonating someone" = "انتحال صفة شخص آخر";

/* Footer description that explains that the relay server requires payment to post. */
"This is a paid relay, you must pay for posts to be accepted." = "هذا موصل بمقابل، يجب الاشتراك للنشر فيه";

/* Warning that the inputted account key is a public key and the result of what happens because of it. */
"This is a public key, you will not be able to make posts or interact in any way. This is used for viewing accounts from their perspective." = "هذا مفتاح عام. لن تستطيع النشر أو التفاعل بهذا الحساب بأي طريقة. تستطيع فقط مشاهدة المحتوى العام من منظور صاحب الحساب.";

/* Warning that the inputted account key for login is an old-style and asking user to verify if it is a public key. */
"This is an old-style nostr key. We're not sure if it's a pubkey or private key. Please toggle the button below if this a public key." = "صيغة المفتاح قديمة. لا نستطيع التحديد إذا ما كان المفتاح خاصا أو عاما. الرجاء تفعيل الخانة بالأسفل إذا كان المفتاح عاما.";

/* Label to describe that a public key is the user's account ID and what they can do with it. */
"This is your account ID, you can give this to your friends so that they can follow you. Tap to copy." = "هذا معرف حسابك، يمكنك مشاركته مع الاخرين لمتابعتك. انقر للنسخ.";

/* Label to describe that a private key is the user's secret account key and what they should do with it. */
"This is your secret account key. You need this to access your account. Don't share this with anyone! Save it in a password manager and keep it safe!" = "هذا مفتاح الحساب السري. تحتاجه للدخول إلى حسابك. لا تشاركه مع أي شخص! احتفظ به في مكان آمن مثل برنامج إدارة كلمات المرور السرية. ";

/* Navigation bar title for note thread. */
"Thread" = "منشور";

/* Button to translate note from different language. */
"Translate Note" = "ترجم المنشور";

/* Button to indicate that the note has been translated from a different language. */
"Translated from %@" = "مترجم من %@...";

/* Button to indicate that the note is in the process of being translated from a different language. */
"Translating from %@..." = "يترجم من %@...";

/* Section title for selecting the translation service. */
"Translations" = "الترجمة";

/* Text field prompt asking user to type the word DELETE to confirm that they want to proceed with deleting their account. The all caps lock DELETE word should not be translated. Everything else should. */
"Type DELETE to delete" = "اكتب DELETE لتأكيد الحذف";

/* Text box prompt to ask user to type their post. */
"Type your post here..." = "اكتب المنشور هنا...";

/* Button to unfollow a user. */
"Unfollow" = "الغاء المتابعة";

/* Label to indicate that the user is in the process of unfollowing another user. */
"Unfollowing..." = "يلغي المتابعة...";

/* Toolbar label for the universal view where posts from all connected relay servers appear. */
"Universe 🛸" = "العالم 🛸";

/* Example URL to LibreTranslate server */
"URL" = "رابط";

/* Alert message to indicate the user has been blocked */
"User blocked" = "الحساب محظور";

/* Alert message that informs a user was blocked. */
"User has been blocked" = "تم الحظر";

/* Label for Username section of user profile form.
   Label to prompt username entry. */
"Username" = "اسم المستخدم";

/* Label to display relay software version.
   Section title for displaying the version number of the Damus app. */
"Version" = "الاصدار";

/* Sidebar menu label for Wallet view. */
"Wallet" = "المحفظة";

/* Dropdown option label for Lightning wallet, Wallet of Satoshi. */
"Wallet of Satoshi" = "Wallet of Satoshi";

/* Section title for selection of wallet. */
"Wallet Selector" = "تفضيلات المحفظة";

/* Alert for deleting the users account. */
"WARNING:\n\nTHIS WILL SIGN AN EVENT THAT DELETES THIS ACCOUNT.\n\nYOU WILL NO LONGER BE ABLE TO LOG INTO DAMUS USING THIS ACCOUNT KEY.\n\n ARE YOU SURE YOU WANT TO CONTINUE?" = "تحذير:\nستتم المصادقة على حذف هذا الحساب.\n\nلن تتمكن من تسجيل الدخول لهذا الحساب عبر دامس مجددا.\n\nهل أنت موافق ومتأكد من رغبتك في الاستمرار؟";

/* Label for Website section of user profile form. */
"Website" = "موقع الكتروني";

/* Welcoming message to the reader. The variable is 'you', the reader. */
"Welcome to the social network %@ control." = "%@ مرحبا بك في شبكتك الاجتماعية!";

/* Text to welcome user. */
"Welcome, %@!" = "مرحبا، %@!";

/* Header text to prompt user what issue they want to report. */
"What do you want to report?" = "عن ماذا تريد الابلاغ";

/* Placeholder example for relay server address. */
"wss://some.relay.com" = "wss://some.relay.com";

/* Text of button that confirms to overwrite the existing mutelist. */
"Yes, Overwrite" = "نعم، استبدل";

/* Button to proceed with posting a note even though it looks like they might be posting a private key. */
"Yes, Post with Private Key" = "نعم، انشر المفتاح الخاص";

/* You, in this context, is the person who controls their own social network. You is used in the context of a larger sentence that welcomes the reader to the social network that they control themself. */
"you" = "أنت";

/* Text indicating that there are no bookmarks to be viewed */
"You have no bookmarks yet, add them in the context menu" = "لا يوجد منشورات مرجعية الان. يمكنك الاضافة لقائمة المنشورات عن طريق الضغط المطول على المنشور.";

/* Label for Your Name section of user profile form. */
"Your Name" = "الاسم";

/* Footer text to inform user what will happen when the report is submitted. */
"Your report will be sent to the relays you are connected to" = "سيتم ارسال بلاغك للموصّلات المتصلة بحسابك";

/* Accessibility label for zap button
   Button to send a zap. */
"Zap" = "ومضة";

/* Title of picker that allows selection of predefined amounts to zap. */
"Zap Amount" = "قيمة الومضة";

/* Header text to indicate that the picker below it is to choose a pre-defined amount of sats to zap. */
"Zap Amount in sats" = "قيمة الومضة بالساتوشي";

/* Header text to indicate that the picker below it is to choose the type of zap to send. */
"Zap Type" = "نوع الومضة";

/* Setting to enable vibration on zap */
"Zap Vibration" = "اهتزاز الوميض";

/* Text to indicate that the app is in the process of sending a zap. */
"Zapping..." = "التوميض...";

/* Label for filter for zap notifications.
   Navigation bar title for the Zaps view. */
"Zaps" = "وميض";

/* Dropdown option label for Lightning wallet, Zebedee. */
"Zebedee" = "Zebedee";

/* Dropdown option label for Lightning wallet, Zeus LN. */
"Zeus LN" = "Zeus LN";

/* Text indicating the zap amount. i.e. number of satoshis that were tipped to a user */
"⚡️ %@" = "⚡️ %@";

